//Создайте консольное приложение,
//в котором будет происходить сортировка списка фамилий из пяти человек.
//Сортировка должна происходить при помощи события.
//Сортировка происходит при введении пользователем либо числа 1 (сортировка А-Я),
//либо числа 2 (сортировка Я-А).

namespace DelegatePractices
{
    class Program
    {
        static void Main(string[] args)
        {
            List<string> fams = new List<string>()
            {
                "Иванов",
                "Петров",
                "Сидоров"
            };
            
            
        }
        
    }
}